Autodesk.Revit.DB.Macros.DocumentEntryPoint.AddinFolder
The full path to the Revit Macros module.
Remarks:  This path should be used instead of the .NET GetExecutingAssembly() result, because
the Macros module is loaded in such a way to make that result unreliable.
Since:  2014

Autodesk.Revit.DB.Macros.DocumentEntryPoint.OnShutdownEO
For Revit Macros internal use only.
Since:  2014

Autodesk.Revit.DB.Macros.DocumentEntryPoint.FinishInitializationEO
For Revit Macros internal use only.
Since:  2014

Autodesk.Revit.DB.Macros.DocumentEntryPoint.Initialize(System.Object,System.String)
For Revit Macros internal use only.
Since:  2014

Autodesk.Revit.DB.Macros.DocumentEntryPoint
For Revit Macros use only.
Since:  2014